set_property BITSTREAM.GENERAL.COMPRESS TRUE [current_design]
set_property CFGBVS VCCO [current_design]
set_property CONFIG_VOLTAGE 3.3 [current_design]


##data to DAC

set_property -dict {PACKAGE_PIN B4 IOSTANDARD LVCMOS33} [get_ports {I_OUT[0]}]
set_property -dict {PACKAGE_PIN C4 IOSTANDARD LVCMOS33} [get_ports {I_OUT[1]}]
set_property -dict {PACKAGE_PIN D7 IOSTANDARD LVCMOS33} [get_ports {I_OUT[2]}]
set_property -dict {PACKAGE_PIN E7 IOSTANDARD LVCMOS33} [get_ports {I_OUT[3]}]
set_property -dict {PACKAGE_PIN E5 IOSTANDARD LVCMOS33} [get_ports {I_OUT[4]}]
set_property -dict {PACKAGE_PIN E6 IOSTANDARD LVCMOS33} [get_ports {I_OUT[5]}]
set_property -dict {PACKAGE_PIN C7 IOSTANDARD LVCMOS33} [get_ports {I_OUT[6]}]
set_property -dict {PACKAGE_PIN D8 IOSTANDARD LVCMOS33} [get_ports {I_OUT[7]}]
set_property -dict {PACKAGE_PIN A5 IOSTANDARD LVCMOS33} [get_ports {I_OUT[8]}]
set_property -dict {PACKAGE_PIN A6 IOSTANDARD LVCMOS33} [get_ports {I_OUT[9]}]

set_property -dict {PACKAGE_PIN D3 IOSTANDARD LVCMOS33} [get_ports {Q_OUT[0]}]
set_property -dict {PACKAGE_PIN E3 IOSTANDARD LVCMOS33} [get_ports {Q_OUT[1]}]
set_property -dict {PACKAGE_PIN D4 IOSTANDARD LVCMOS33} [get_ports {Q_OUT[2]}]
set_property -dict {PACKAGE_PIN D5 IOSTANDARD LVCMOS33} [get_ports {Q_OUT[3]}]
set_property -dict {PACKAGE_PIN B2 IOSTANDARD LVCMOS33} [get_ports {Q_OUT[4]}]
set_property -dict {PACKAGE_PIN B3 IOSTANDARD LVCMOS33} [get_ports {Q_OUT[5]}]
set_property -dict {PACKAGE_PIN A1 IOSTANDARD LVCMOS33} [get_ports {Q_OUT[6]}]
set_property -dict {PACKAGE_PIN B1 IOSTANDARD LVCMOS33} [get_ports {Q_OUT[7]}]
set_property -dict {PACKAGE_PIN A3 IOSTANDARD LVCMOS33} [get_ports {Q_OUT[8]}]
set_property -dict {PACKAGE_PIN A4 IOSTANDARD LVCMOS33} [get_ports {Q_OUT[9]}]

set_property -dict {PACKAGE_PIN F5 IOSTANDARD LVCMOS33} [get_ports DAC_SLEEP]
set_property -dict {PACKAGE_PIN C6 IOSTANDARD LVCMOS33} [get_ports DAC_CLK_I]
set_property -dict {PACKAGE_PIN B7 IOSTANDARD LVCMOS33} [get_ports DAC_CLK_Q]
set_property -dict {PACKAGE_PIN C5 IOSTANDARD LVCMOS33} [get_ports DAC_WRT_I]
set_property -dict {PACKAGE_PIN B6 IOSTANDARD LVCMOS33} [get_ports DAC_WRT_Q]

set_property -dict {PACKAGE_PIN F4 IOSTANDARD LVCMOS33} [get_ports clock_rtl]
create_clock -period 10.000 [get_ports clock_rtl]

set_property -dict {PACKAGE_PIN H1 IOSTANDARD LVCMOS33} [get_ports STM_GPIOA2]
set_property -dict {PACKAGE_PIN G1 IOSTANDARD LVCMOS33} [get_ports STM_GPIOA1]
set_property -dict {PACKAGE_PIN F1 IOSTANDARD LVCMOS33} [get_ports FPGA_RDY]
set_property -dict {PACKAGE_PIN H6 IOSTANDARD LVCMOS33} [get_ports RESET]
set_property -dict {PACKAGE_PIN H5 IOSTANDARD LVCMOS33} [get_ports VCC_OFF]

set_property -dict {PACKAGE_PIN D15 IOSTANDARD LVDS_25 DIFF_TERM 1} [get_ports CLK_IN_P]
set_property DIFF_TERM TRUE [get_ports CLK_IN_N]
create_clock -period 33.333 [get_ports CLK_IN_P]

set_input_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -max 6.000 [get_ports RESET]
set_input_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -min 2.000 [get_ports RESET]
set_input_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -max 6.000 [get_ports VCC_OFF]
set_input_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -min 2.000 [get_ports VCC_OFF]
set_input_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -max 6.000 [get_ports STM_GPIOA1]
set_input_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -min 2.000 [get_ports STM_GPIOA1]
set_input_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -max 6.000 [get_ports STM_GPIOA2]
set_input_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -min 2.000 [get_ports STM_GPIOA2]
set_input_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -max 6.000 [get_ports DATA_IN_P]
set_input_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -min 2.000 [get_ports DATA_IN_P]

set_output_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -max 1.100 [get_ports {I_OUT[*]}]
set_output_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -min -1.000 [get_ports {I_OUT[*]}]
set_output_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -max 1.100 [get_ports {Q_OUT[*]}]
set_output_delay -clock [get_clocks clk_out3_bld_clk_wiz_5_2] -min -1.000 [get_ports {Q_OUT[*]}]

set_false_path -from [get_ports RESET] -to [get_pins {{bd_i/PRS_bit_real_0/U0/counter_reg[0]/CLR} {bd_i/PRS_bit_real_0/U0/counter_reg[10]/CLR} {bd_i/PRS_bit_real_0/U0/counter_reg[1]/CLR} {bd_i/PRS_bit_real_0/U0/counter_reg[2]/CLR} {bd_i/PRS_bit_real_0/U0/counter_reg[3]/CLR} {bd_i/PRS_bit_real_0/U0/counter_reg[4]/CLR} {bd_i/PRS_bit_real_0/U0/counter_reg[5]/CLR} {bd_i/PRS_bit_real_0/U0/counter_reg[6]/CLR} {bd_i/PRS_bit_real_0/U0/counter_reg[7]/CLR} {bd_i/PRS_bit_real_0/U0/counter_reg[8]/CLR} {bd_i/PRS_bit_real_0/U0/counter_reg[9]/CLR} bd_i/PRS_bit_real_0/U0/encf_reg/CLR bd_i/PRS_bit_real_0/U0/enprs_reg/CLR bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/CLR bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/CLR {bd_i/filter50_0/U0/cur_count_reg[0]/CLR} {bd_i/filter50_0/U0/cur_count_reg[1]/CLR} {bd_i/filter50_0/U0/cur_count_reg[2]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[0][0]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[0][1]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[0][2]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[0][3]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[0][4]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[0][5]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[0][6]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[0][7]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[0][8]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[0][9]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[1][0]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[1][1]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[1][2]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[1][3]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[1][4]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[1][5]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[1][6]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[1][7]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[1][8]/CLR} {bd_i/filter50_0/U0/delay_section1_reg[1][9]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[0][0]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[0][1]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[0][2]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[0][3]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[0][4]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[0][5]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[0][6]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[0][7]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[0][8]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[0][9]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[1][0]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[1][1]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[1][2]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[1][3]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[1][4]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[1][5]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[1][6]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[1][7]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[1][8]/CLR} {bd_i/filter50_0/U0/delay_section2_reg[1][9]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[0][0]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[0][1]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[0][2]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[0][3]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[0][4]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[0][5]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[0][6]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[0][7]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[0][8]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[0][9]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[1][0]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[1][1]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[1][2]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[1][3]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[1][4]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[1][5]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[1][6]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[1][7]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[1][8]/CLR} {bd_i/filter50_0/U0/delay_section3_reg[1][9]/CLR} {bd_i/filter50_0/U0/input_register_reg[0]/CLR} {bd_i/filter50_0/U0/input_register_reg[1]/CLR} {bd_i/filter50_0/U0/input_register_reg[2]/CLR} {bd_i/filter50_0/U0/input_register_reg[3]/CLR} {bd_i/filter50_0/U0/input_register_reg[4]/CLR} {bd_i/filter50_0/U0/input_register_reg[5]/CLR} {bd_i/filter50_0/U0/input_register_reg[6]/CLR} {bd_i/filter50_0/U0/input_register_reg[7]/CLR} {bd_i/filter50_0/U0/input_register_reg[8]/CLR} {bd_i/filter50_0/U0/input_register_reg[9]/CLR} {bd_i/filter50_0/U0/output_register_reg[0]/CLR} {bd_i/filter50_0/U0/output_register_reg[1]/CLR} {bd_i/filter50_0/U0/output_register_reg[2]/CLR} {bd_i/filter50_0/U0/output_register_reg[3]/CLR} {bd_i/filter50_0/U0/output_register_reg[4]/CLR} {bd_i/filter50_0/U0/output_register_reg[5]/CLR} {bd_i/filter50_0/U0/output_register_reg[6]/CLR} {bd_i/filter50_0/U0/output_register_reg[7]/CLR} {bd_i/filter50_0/U0/output_register_reg[8]/CLR} {bd_i/filter50_0/U0/output_register_reg[9]/CLR} {bd_i/filter50_0/U0/prev_stg_op1_reg[0]/CLR} {bd_i/filter50_0/U0/prev_stg_op1_reg[1]/CLR} {bd_i/filter50_0/U0/prev_stg_op1_reg[2]/CLR} {bd_i/filter50_0/U0/prev_stg_op1_reg[3]/CLR} {bd_i/filter50_0/U0/prev_stg_op1_reg[4]/CLR} {bd_i/filter50_0/U0/prev_stg_op1_reg[5]/CLR} {bd_i/filter50_0/U0/prev_stg_op1_reg[6]/CLR} {bd_i/filter50_0/U0/prev_stg_op1_reg[7]/CLR} {bd_i/filter50_0/U0/prev_stg_op1_reg[8]/CLR} {bd_i/filter50_0/U0/prev_stg_op1_reg[9]/CLR} {bd_i/filter50_0/U0/prev_stg_op2_reg[0]/CLR} {bd_i/filter50_0/U0/prev_stg_op2_reg[1]/CLR} {bd_i/filter50_0/U0/prev_stg_op2_reg[2]/CLR} {bd_i/filter50_0/U0/prev_stg_op2_reg[3]/CLR} {bd_i/filter50_0/U0/prev_stg_op2_reg[4]/CLR} {bd_i/filter50_0/U0/prev_stg_op2_reg[5]/CLR} {bd_i/filter50_0/U0/prev_stg_op2_reg[6]/CLR} {bd_i/filter50_0/U0/prev_stg_op2_reg[7]/CLR} {bd_i/filter50_0/U0/prev_stg_op2_reg[8]/CLR} {bd_i/filter50_0/U0/prev_stg_op2_reg[9]/CLR} {bd_i/filter50_0/U0/storage_state_in1_reg[0]/CLR} {bd_i/filter50_0/U0/storage_state_in1_reg[1]/CLR} {bd_i/filter50_0/U0/storage_state_in1_reg[2]/CLR} {bd_i/filter50_0/U0/storage_state_in1_reg[3]/CLR} {bd_i/filter50_0/U0/storage_state_in1_reg[4]/CLR} {bd_i/filter50_0/U0/storage_state_in1_reg[5]/CLR} {bd_i/filter50_0/U0/storage_state_in1_reg[6]/CLR} {bd_i/filter50_0/U0/storage_state_in1_reg[7]/CLR} {bd_i/filter50_0/U0/storage_state_in1_reg[8]/CLR} {bd_i/filter50_0/U0/storage_state_in1_reg[9]/CLR} {bd_i/filter50_0/U0/storage_state_in2_reg[0]/CLR} {bd_i/filter50_0/U0/storage_state_in2_reg[1]/CLR} {bd_i/filter50_0/U0/storage_state_in2_reg[2]/CLR} {bd_i/filter50_0/U0/storage_state_in2_reg[3]/CLR} {bd_i/filter50_0/U0/storage_state_in2_reg[4]/CLR} {bd_i/filter50_0/U0/storage_state_in2_reg[5]/CLR} {bd_i/filter50_0/U0/storage_state_in2_reg[6]/CLR} {bd_i/filter50_0/U0/storage_state_in2_reg[7]/CLR} {bd_i/filter50_0/U0/storage_state_in2_reg[8]/CLR} {bd_i/filter50_0/U0/storage_state_in2_reg[9]/CLR} {bd_i/filter50_0/U0/storage_state_in3_reg[0]/CLR} {bd_i/filter50_0/U0/storage_state_in3_reg[1]/CLR} {bd_i/filter50_0/U0/storage_state_in3_reg[2]/CLR} {bd_i/filter50_0/U0/storage_state_in3_reg[3]/CLR} {bd_i/filter50_0/U0/storage_state_in3_reg[4]/CLR} {bd_i/filter50_0/U0/storage_state_in3_reg[5]/CLR} {bd_i/filter50_0/U0/storage_state_in3_reg[6]/CLR} {bd_i/filter50_0/U0/storage_state_in3_reg[7]/CLR} {bd_i/filter50_0/U0/storage_state_in3_reg[8]/CLR} {bd_i/filter50_0/U0/storage_state_in3_reg[9]/CLR} {bd_i/filter50_1/U0/cur_count_reg[0]/CLR} {bd_i/filter50_1/U0/cur_count_reg[1]/CLR} {bd_i/filter50_1/U0/cur_count_reg[2]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[0][0]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[0][1]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[0][2]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[0][3]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[0][4]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[0][5]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[0][6]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[0][7]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[0][8]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[0][9]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[1][0]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[1][1]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[1][2]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[1][3]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[1][4]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[1][5]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[1][6]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[1][7]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[1][8]/CLR} {bd_i/filter50_1/U0/delay_section1_reg[1][9]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[0][0]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[0][1]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[0][2]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[0][3]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[0][4]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[0][5]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[0][6]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[0][7]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[0][8]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[0][9]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[1][0]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[1][1]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[1][2]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[1][3]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[1][4]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[1][5]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[1][6]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[1][7]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[1][8]/CLR} {bd_i/filter50_1/U0/delay_section2_reg[1][9]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[0][0]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[0][1]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[0][2]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[0][3]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[0][4]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[0][5]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[0][6]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[0][7]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[0][8]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[0][9]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[1][0]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[1][1]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[1][2]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[1][3]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[1][4]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[1][5]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[1][6]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[1][7]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[1][8]/CLR} {bd_i/filter50_1/U0/delay_section3_reg[1][9]/CLR} {bd_i/filter50_1/U0/input_register_reg[0]/CLR} {bd_i/filter50_1/U0/input_register_reg[1]/CLR} {bd_i/filter50_1/U0/input_register_reg[2]/CLR} {bd_i/filter50_1/U0/input_register_reg[3]/CLR} {bd_i/filter50_1/U0/input_register_reg[4]/CLR} {bd_i/filter50_1/U0/input_register_reg[5]/CLR} {bd_i/filter50_1/U0/input_register_reg[6]/CLR} {bd_i/filter50_1/U0/input_register_reg[7]/CLR} {bd_i/filter50_1/U0/input_register_reg[8]/CLR} {bd_i/filter50_1/U0/input_register_reg[9]/CLR} {bd_i/filter50_1/U0/output_register_reg[0]/CLR} {bd_i/filter50_1/U0/output_register_reg[1]/CLR} {bd_i/filter50_1/U0/output_register_reg[2]/CLR} {bd_i/filter50_1/U0/output_register_reg[3]/CLR} {bd_i/filter50_1/U0/output_register_reg[4]/CLR} {bd_i/filter50_1/U0/output_register_reg[5]/CLR} {bd_i/filter50_1/U0/output_register_reg[6]/CLR} {bd_i/filter50_1/U0/output_register_reg[7]/CLR} {bd_i/filter50_1/U0/output_register_reg[8]/CLR} {bd_i/filter50_1/U0/output_register_reg[9]/CLR} {bd_i/filter50_1/U0/prev_stg_op1_reg[0]/CLR} {bd_i/filter50_1/U0/prev_stg_op1_reg[1]/CLR} {bd_i/filter50_1/U0/prev_stg_op1_reg[2]/CLR} {bd_i/filter50_1/U0/prev_stg_op1_reg[3]/CLR} {bd_i/filter50_1/U0/prev_stg_op1_reg[4]/CLR} {bd_i/filter50_1/U0/prev_stg_op1_reg[5]/CLR} {bd_i/filter50_1/U0/prev_stg_op1_reg[6]/CLR} {bd_i/filter50_1/U0/prev_stg_op1_reg[7]/CLR} {bd_i/filter50_1/U0/prev_stg_op1_reg[8]/CLR} {bd_i/filter50_1/U0/prev_stg_op1_reg[9]/CLR} {bd_i/filter50_1/U0/prev_stg_op2_reg[0]/CLR} {bd_i/filter50_1/U0/prev_stg_op2_reg[1]/CLR} {bd_i/filter50_1/U0/prev_stg_op2_reg[2]/CLR} {bd_i/filter50_1/U0/prev_stg_op2_reg[3]/CLR} {bd_i/filter50_1/U0/prev_stg_op2_reg[4]/CLR} {bd_i/filter50_1/U0/prev_stg_op2_reg[5]/CLR} {bd_i/filter50_1/U0/prev_stg_op2_reg[6]/CLR} {bd_i/filter50_1/U0/prev_stg_op2_reg[7]/CLR} {bd_i/filter50_1/U0/prev_stg_op2_reg[8]/CLR} {bd_i/filter50_1/U0/prev_stg_op2_reg[9]/CLR} {bd_i/filter50_1/U0/storage_state_in1_reg[0]/CLR} {bd_i/filter50_1/U0/storage_state_in1_reg[1]/CLR} {bd_i/filter50_1/U0/storage_state_in1_reg[2]/CLR} {bd_i/filter50_1/U0/storage_state_in1_reg[3]/CLR} {bd_i/filter50_1/U0/storage_state_in1_reg[4]/CLR} {bd_i/filter50_1/U0/storage_state_in1_reg[5]/CLR} {bd_i/filter50_1/U0/storage_state_in1_reg[6]/CLR} {bd_i/filter50_1/U0/storage_state_in1_reg[7]/CLR} {bd_i/filter50_1/U0/storage_state_in1_reg[8]/CLR} {bd_i/filter50_1/U0/storage_state_in1_reg[9]/CLR} {bd_i/filter50_1/U0/storage_state_in2_reg[0]/CLR} {bd_i/filter50_1/U0/storage_state_in2_reg[1]/CLR} {bd_i/filter50_1/U0/storage_state_in2_reg[2]/CLR} {bd_i/filter50_1/U0/storage_state_in2_reg[3]/CLR} {bd_i/filter50_1/U0/storage_state_in2_reg[4]/CLR} {bd_i/filter50_1/U0/storage_state_in2_reg[5]/CLR} {bd_i/filter50_1/U0/storage_state_in2_reg[6]/CLR} {bd_i/filter50_1/U0/storage_state_in2_reg[7]/CLR} {bd_i/filter50_1/U0/storage_state_in2_reg[8]/CLR} {bd_i/filter50_1/U0/storage_state_in2_reg[9]/CLR} {bd_i/filter50_1/U0/storage_state_in3_reg[0]/CLR} {bd_i/filter50_1/U0/storage_state_in3_reg[1]/CLR} {bd_i/filter50_1/U0/storage_state_in3_reg[2]/CLR} {bd_i/filter50_1/U0/storage_state_in3_reg[3]/CLR} {bd_i/filter50_1/U0/storage_state_in3_reg[4]/CLR} {bd_i/filter50_1/U0/storage_state_in3_reg[5]/CLR} {bd_i/filter50_1/U0/storage_state_in3_reg[6]/CLR} {bd_i/filter50_1/U0/storage_state_in3_reg[7]/CLR} {bd_i/filter50_1/U0/storage_state_in3_reg[8]/CLR} {bd_i/filter50_1/U0/storage_state_in3_reg[9]/CLR} {bd_i/filter7gbz_0/U0/cur_count_reg[0]/CLR} {bd_i/filter7gbz_0/U0/cur_count_reg[1]/CLR} {bd_i/filter7gbz_0/U0/cur_count_reg[2]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[0][0]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[0][1]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[0][2]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[0][3]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[0][4]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[0][5]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[0][6]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[0][7]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[0][8]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[0][9]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[1][0]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[1][1]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[1][2]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[1][3]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[1][4]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[1][5]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[1][6]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[1][7]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[1][8]/CLR} {bd_i/filter7gbz_0/U0/delay_section1_reg[1][9]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][0]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][1]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][2]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][3]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][4]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][5]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][6]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][7]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][8]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][9]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[1][0]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[1][1]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[1][2]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[1][3]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[1][4]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[1][5]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[1][6]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[1][7]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[1][8]/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[1][9]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[0][0]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[0][1]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[0][2]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[0][3]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[0][4]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[0][5]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[0][6]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[0][7]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[0][8]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[0][9]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[1][0]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[1][1]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[1][2]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[1][3]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[1][4]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[1][5]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[1][6]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[1][7]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[1][8]/CLR} {bd_i/filter7gbz_0/U0/delay_section3_reg[1][9]/CLR} {bd_i/filter7gbz_0/U0/input_register_reg[0]/CLR} {bd_i/filter7gbz_0/U0/input_register_reg[1]/CLR} {bd_i/filter7gbz_0/U0/input_register_reg[2]/CLR} {bd_i/filter7gbz_0/U0/input_register_reg[3]/CLR} {bd_i/filter7gbz_0/U0/input_register_reg[4]/CLR} {bd_i/filter7gbz_0/U0/input_register_reg[5]/CLR} {bd_i/filter7gbz_0/U0/input_register_reg[6]/CLR} {bd_i/filter7gbz_0/U0/input_register_reg[7]/CLR} {bd_i/filter7gbz_0/U0/input_register_reg[8]/CLR} {bd_i/filter7gbz_0/U0/input_register_reg[9]/CLR} {bd_i/filter7gbz_0/U0/output_register_reg[0]/CLR} {bd_i/filter7gbz_0/U0/output_register_reg[1]/CLR} {bd_i/filter7gbz_0/U0/output_register_reg[2]/CLR} {bd_i/filter7gbz_0/U0/output_register_reg[3]/CLR} {bd_i/filter7gbz_0/U0/output_register_reg[4]/CLR} {bd_i/filter7gbz_0/U0/output_register_reg[5]/CLR} {bd_i/filter7gbz_0/U0/output_register_reg[6]/CLR} {bd_i/filter7gbz_0/U0/output_register_reg[7]/CLR} {bd_i/filter7gbz_0/U0/output_register_reg[8]/CLR} {bd_i/filter7gbz_0/U0/output_register_reg[9]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op1_reg[0]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op1_reg[1]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op1_reg[2]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op1_reg[3]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op1_reg[4]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op1_reg[5]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op1_reg[6]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op1_reg[7]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op1_reg[8]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op1_reg[9]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op2_reg[0]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op2_reg[1]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op2_reg[2]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op2_reg[3]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op2_reg[4]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op2_reg[5]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op2_reg[6]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op2_reg[7]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op2_reg[8]/CLR} {bd_i/filter7gbz_0/U0/prev_stg_op2_reg[9]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in1_reg[0]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in1_reg[1]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in1_reg[2]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in1_reg[3]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in1_reg[4]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in1_reg[5]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in1_reg[6]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in1_reg[7]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in1_reg[8]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in1_reg[9]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in2_reg[0]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in2_reg[1]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in2_reg[2]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in2_reg[3]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in2_reg[4]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in2_reg[5]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in2_reg[6]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in2_reg[7]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in2_reg[8]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in2_reg[9]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in3_reg[0]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in3_reg[1]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in3_reg[2]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in3_reg[3]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in3_reg[4]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in3_reg[5]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in3_reg[6]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in3_reg[7]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in3_reg[8]/CLR} {bd_i/filter7gbz_0/U0/storage_state_in3_reg[9]/CLR} {bd_i/filter7gbz_1/U0/cur_count_reg[0]/CLR} {bd_i/filter7gbz_1/U0/cur_count_reg[1]/CLR} {bd_i/filter7gbz_1/U0/cur_count_reg[2]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[0][0]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[0][1]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[0][2]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[0][3]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[0][4]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[0][5]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[0][6]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[0][7]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[0][8]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[0][9]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[1][0]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[1][1]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[1][2]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[1][3]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[1][4]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[1][5]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[1][6]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[1][7]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[1][8]/CLR} {bd_i/filter7gbz_1/U0/delay_section1_reg[1][9]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[0][0]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[0][1]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[0][2]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[0][3]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[0][4]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[0][5]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[0][6]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[0][7]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[0][8]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[0][9]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[1][0]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[1][1]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[1][2]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[1][3]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[1][4]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[1][5]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[1][6]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[1][7]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[1][8]/CLR} {bd_i/filter7gbz_1/U0/delay_section2_reg[1][9]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[0][0]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[0][1]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[0][2]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[0][3]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[0][4]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[0][5]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[0][6]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[0][7]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[0][8]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[0][9]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[1][0]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[1][1]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[1][2]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[1][3]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[1][4]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[1][5]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[1][6]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[1][7]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[1][8]/CLR} {bd_i/filter7gbz_1/U0/delay_section3_reg[1][9]/CLR} {bd_i/filter7gbz_1/U0/input_register_reg[0]/CLR} {bd_i/filter7gbz_1/U0/input_register_reg[1]/CLR} {bd_i/filter7gbz_1/U0/input_register_reg[2]/CLR} {bd_i/filter7gbz_1/U0/input_register_reg[3]/CLR} {bd_i/filter7gbz_1/U0/input_register_reg[4]/CLR} {bd_i/filter7gbz_1/U0/input_register_reg[5]/CLR} {bd_i/filter7gbz_1/U0/input_register_reg[6]/CLR} {bd_i/filter7gbz_1/U0/input_register_reg[7]/CLR} {bd_i/filter7gbz_1/U0/input_register_reg[8]/CLR} {bd_i/filter7gbz_1/U0/input_register_reg[9]/CLR} {bd_i/filter7gbz_1/U0/output_register_reg[0]/CLR} {bd_i/filter7gbz_1/U0/output_register_reg[1]/CLR} {bd_i/filter7gbz_1/U0/output_register_reg[2]/CLR} {bd_i/filter7gbz_1/U0/output_register_reg[3]/CLR} {bd_i/filter7gbz_1/U0/output_register_reg[4]/CLR} {bd_i/filter7gbz_1/U0/output_register_reg[5]/CLR} {bd_i/filter7gbz_1/U0/output_register_reg[6]/CLR} {bd_i/filter7gbz_1/U0/output_register_reg[7]/CLR} {bd_i/filter7gbz_1/U0/output_register_reg[8]/CLR} {bd_i/filter7gbz_1/U0/output_register_reg[9]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op1_reg[0]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op1_reg[1]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op1_reg[2]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op1_reg[3]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op1_reg[4]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op1_reg[5]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op1_reg[6]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op1_reg[7]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op1_reg[8]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op1_reg[9]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op2_reg[0]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op2_reg[1]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op2_reg[2]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op2_reg[3]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op2_reg[4]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op2_reg[5]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op2_reg[6]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op2_reg[7]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op2_reg[8]/CLR} {bd_i/filter7gbz_1/U0/prev_stg_op2_reg[9]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in1_reg[0]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in1_reg[1]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in1_reg[2]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in1_reg[3]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in1_reg[4]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in1_reg[5]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in1_reg[6]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in1_reg[7]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in1_reg[8]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in1_reg[9]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in2_reg[0]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in2_reg[1]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in2_reg[2]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in2_reg[3]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in2_reg[4]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in2_reg[5]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in2_reg[6]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in2_reg[7]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in2_reg[8]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in2_reg[9]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in3_reg[0]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in3_reg[1]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in3_reg[2]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in3_reg[3]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in3_reg[4]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in3_reg[5]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in3_reg[6]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in3_reg[7]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in3_reg[8]/CLR} {bd_i/filter7gbz_1/U0/storage_state_in3_reg[9]/CLR} {bd_i/filter7gbz_1/U0/cur_count_reg[2]_replica/CLR} {bd_i/filter7gbz_1/U0/cur_count_reg[2]_replica_1/CLR} {bd_i/filter7gbz_1/U0/cur_count_reg[2]_replica_2/CLR} {bd_i/filter7gbz_1/U0/cur_count_reg[2]_replica_3/CLR} {bd_i/filter7gbz_1/U0/cur_count_reg[0]_replica/CLR} {bd_i/filter7gbz_1/U0/cur_count_reg[0]_replica_1/CLR} {bd_i/filter7gbz_1/U0/cur_count_reg[0]_replica_2/CLR} {bd_i/filter7gbz_0/U0/cur_count_reg[2]_replica/CLR} {bd_i/filter7gbz_0/U0/cur_count_reg[2]_replica_1/CLR} {bd_i/filter7gbz_0/U0/cur_count_reg[2]_replica_2/CLR} {bd_i/filter7gbz_0/U0/cur_count_reg[2]_replica_3/CLR} {bd_i/filter50_0/U0/cur_count_reg[1]_replica/CLR} {bd_i/filter50_0/U0/cur_count_reg[1]_replica_1/CLR} {bd_i/filter50_1/U0/cur_count_reg[2]_replica/CLR} {bd_i/filter50_1/U0/cur_count_reg[2]_replica_1/CLR} {bd_i/filter50_1/U0/cur_count_reg[2]_replica_2/CLR} {bd_i/filter50_1/U0/cur_count_reg[0]_replica/CLR} {bd_i/filter50_1/U0/cur_count_reg[0]_replica_1/CLR} {bd_i/filter50_0/U0/cur_count_reg[2]_replica/CLR} {bd_i/filter50_0/U0/cur_count_reg[2]_replica_1/CLR} {bd_i/filter50_0/U0/cur_count_reg[2]_replica_2/CLR} {bd_i/filter50_0/U0/cur_count_reg[0]_replica/CLR} {bd_i/filter50_0/U0/cur_count_reg[0]_replica_1/CLR} {bd_i/filter50_1/U0/cur_count_reg[1]_replica/CLR} {bd_i/filter50_1/U0/cur_count_reg[1]_replica_1/CLR} {bd_i/filter50_1/U0/cur_count_reg[1]_replica_2/CLR} {bd_i/filter50_1/U0/cur_count_reg[1]_replica_3/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][8]_replica/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][7]_replica/CLR} {bd_i/filter7gbz_0/U0/delay_section2_reg[0][0]_replica/CLR}}]

set_property -dict {PACKAGE_PIN B13 IOSTANDARD LVDS_25 DIFF_TERM 1} [get_ports DATA_IN_P]
set_property DIFF_TERM TRUE [get_ports DATA_IN_N]

set_false_path -from [get_cells {bd_i/vio_0/inst/PROBE_OUT_ALL_INST/G_PROBE_OUT[0].PROBE_OUT0_INST/Probe_out_reg[0]}]
set_false_path -from [get_cells {bd_i/vio_0/inst/PROBE_OUT_ALL_INST/G_PROBE_OUT[1].PROBE_OUT0_INST/Probe_out_reg[0]}]
set_false_path -from [get_cells {bd_i/vio_0/inst/PROBE_OUT_ALL_INST/G_PROBE_OUT[2].PROBE_OUT0_INST/Probe_out_reg[0]}]
set_false_path -from [get_cells {bd_i/vio_0/inst/PROBE_OUT_ALL_INST/G_PROBE_OUT[3].PROBE_OUT0_INST/Probe_out_reg[0]}]
set_false_path -from [get_cells {bd_i/vio_0/inst/PROBE_OUT_ALL_INST/G_PROBE_OUT[4].PROBE_OUT0_INST/Probe_out_reg[0]}]
set_false_path -from [get_cells {bd_i/vio_0/inst/PROBE_OUT_ALL_INST/G_PROBE_OUT[5].PROBE_OUT0_INST/Probe_out_reg[0]}]
set_false_path -from [get_cells {bd_i/vio_0/inst/PROBE_OUT_ALL_INST/G_PROBE_OUT[6].PROBE_OUT0_INST/Probe_out_reg[0]}]

set_clock_groups -logically_exclusive -group [get_clocks -include_generated_clocks clk_out3_bld_clk_wiz_5_2] -group [get_clocks -include_generated_clocks clk_out4_bld_clk_wiz_5_2]
set_clock_groups -logically_exclusive -group [get_clocks -include_generated_clocks clk_out3_bld_clk_wiz_5_2] -group [get_clocks -include_generated_clocks clk_out2_bld_clk_wiz_5_2]
set_clock_groups -logically_exclusive -group [get_clocks -include_generated_clocks clk_out1_bld_clk_wiz_5_2] -group [get_clocks -include_generated_clocks clk_out4_bld_clk_wiz_5_2]
set_clock_groups -logically_exclusive -group [get_clocks -include_generated_clocks clk_out1_bld_clk_wiz_1_1] -group [get_clocks -include_generated_clocks clk_out2_bld_clk_wiz_1_1]
set_clock_groups -logically_exclusive -group [get_clocks -include_generated_clocks clk_out1_bld_clk_wiz_5_1] -group [get_clocks -include_generated_clocks clk_out2_bld_clk_wiz_5_1]
set_clock_groups -logically_exclusive -group [get_clocks -include_generated_clocks clk_out1_bld_clk_wiz_5_2] -group [get_clocks -include_generated_clocks clk_out2_bld_clk_wiz_5_2]

set_max_delay -datapath_only -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins bd_i/Top_Transceiver_French_0/U0/coding/Dz0_reg/D] 20.000

set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[6]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[6]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 3
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[6]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[6]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 3
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[6]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[6]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 3
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[9]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[6]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[6]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[7]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 1
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 2
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[8]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/counter_reg[10]/D}] 1

set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[6]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[6]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 2
set_multicycle_path -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 2

set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[5]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[4]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[3]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[2]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[6]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[1]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[6]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[7]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[8]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[9]/D}] 1
set_multicycle_path -hold -from [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[0]/C}] -to [get_pins {bd_i/PRS_bit_real_0/U0/count_PRS_reg[10]/D}] 1

set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/coding/Dz0_reg/C] -to [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/D] 20.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/coding/Dz0_reg/C] -to [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/D] 20.000

set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter7gbz_0/U0/input_register_reg[0]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter7gbz_0/U0/input_register_reg[1]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter7gbz_0/U0/input_register_reg[2]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter7gbz_0/U0/input_register_reg[3]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter7gbz_0/U0/input_register_reg[4]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter7gbz_0/U0/input_register_reg[5]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter7gbz_0/U0/input_register_reg[6]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter7gbz_0/U0/input_register_reg[7]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter7gbz_0/U0/input_register_reg[8]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter7gbz_0/U0/input_register_reg[9]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter7gbz_1/U0/input_register_reg[0]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter7gbz_1/U0/input_register_reg[1]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter7gbz_1/U0/input_register_reg[2]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter7gbz_1/U0/input_register_reg[3]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter7gbz_1/U0/input_register_reg[4]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter7gbz_1/U0/input_register_reg[5]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter7gbz_1/U0/input_register_reg[6]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter7gbz_1/U0/input_register_reg[7]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter7gbz_1/U0/input_register_reg[8]/D}] 4.167
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter7gbz_1/U0/input_register_reg[9]/D}] 4.167

set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter50_1/U0/input_register_reg[0]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter50_1/U0/input_register_reg[1]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter50_1/U0/input_register_reg[2]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter50_1/U0/input_register_reg[3]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter50_1/U0/input_register_reg[4]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter50_1/U0/input_register_reg[5]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter50_1/U0/input_register_reg[6]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter50_1/U0/input_register_reg[7]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter50_1/U0/input_register_reg[8]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/I_Out_reg/C] -to [get_pins {bd_i/filter50_1/U0/input_register_reg[9]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter50_0/U0/input_register_reg[0]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter50_0/U0/input_register_reg[1]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter50_0/U0/input_register_reg[2]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter50_0/U0/input_register_reg[3]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter50_0/U0/input_register_reg[4]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter50_0/U0/input_register_reg[5]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter50_0/U0/input_register_reg[6]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter50_0/U0/input_register_reg[7]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter50_0/U0/input_register_reg[8]/D}] 4.000
set_max_delay -datapath_only -from [get_pins bd_i/Top_Transceiver_French_0/U0/IQ_form/Q_Out_reg/C] -to [get_pins {bd_i/filter50_0/U0/input_register_reg[9]/D}] 4.000


set_max_delay -datapath_only -from [get_pins {bd_i/filter50_1/U0/output_register_reg[*]/C}] -to [get_ports {I_OUT[*]}] 16.000


set_max_delay -datapath_only -from [get_pins {bd_i/filter50_0/U0/output_register_reg[*]/C}] -to [get_ports {Q_OUT[*]}] 16.000


set_max_delay -datapath_only -from [get_pins {bd_i/filter7gbz_0/U0/output_register_reg[*]/C}] -to [get_ports {I_OUT[*]}] 16.666


set_max_delay -datapath_only -from [get_pins {bd_i/filter7gbz_1/U0/output_register_reg[*]/C}] -to [get_ports {Q_OUT[*]}] 16.666



set_max_delay -datapath_only -fall_from [get_clocks -of_objects [get_pins bd_i/clk_wiz_7/inst/mmcm_adv_inst/CLKOUT2]] -rise_to [get_clocks -of_objects [get_pins bd_i/clk_wiz_1/inst/mmcm_adv_inst/CLKOUT0]] 4.000
set_max_delay -datapath_only -rise_from [get_clocks -of_objects [get_pins bd_i/clk_wiz_7/inst/mmcm_adv_inst/CLKOUT1]] -rise_to [get_clocks -of_objects [get_pins bd_i/clk_wiz_1/inst/mmcm_adv_inst/CLKOUT0]] 4.000
set_max_delay -datapath_only -rise_from [get_clocks -of_objects [get_pins bd_i/clk_wiz_7/inst/mmcm_adv_inst/CLKOUT0]] -rise_to [get_clocks -of_objects [get_pins bd_i/clk_wiz_1/inst/mmcm_adv_inst/CLKOUT0]] 4.000
set_max_delay -datapath_only -fall_from [get_clocks -of_objects [get_pins bd_i/clk_wiz_7/inst/mmcm_adv_inst/CLKOUT3]] -rise_to [get_clocks -of_objects [get_pins bd_i/clk_wiz_1/inst/mmcm_adv_inst/CLKOUT0]] 4.000

set_max_delay -datapath_only -rise_from [get_clocks -of_objects [get_pins bd_i/clk_wiz_7/inst/mmcm_adv_inst/CLKOUT2]] -rise_to [get_clocks -of_objects [get_pins bd_i/clk_wiz_1/inst/mmcm_adv_inst/CLKOUT0]] 4.000
set_max_delay -datapath_only -rise_from [get_clocks -of_objects [get_pins bd_i/clk_wiz_7/inst/mmcm_adv_inst/CLKOUT3]] -rise_to [get_clocks -of_objects [get_pins bd_i/clk_wiz_1/inst/mmcm_adv_inst/CLKOUT0]] 4.000


set_max_delay -datapath_only -rise_from [get_clocks -of_objects [get_pins bd_i/clk_wiz_7/inst/mmcm_adv_inst/CLKOUT1]] -rise_to [get_clocks -of_objects [get_pins bd_i/clk_wiz_7/inst/mmcm_adv_inst/CLKOUT1]] 24.000
set_max_delay -datapath_only -rise_from [get_clocks -of_objects [get_pins bd_i/clk_wiz_7/inst/mmcm_adv_inst/CLKOUT0]] -rise_to [get_clocks -of_objects [get_pins bd_i/clk_wiz_7/inst/mmcm_adv_inst/CLKOUT0]] 25.000

set_property C_CLK_INPUT_FREQ_HZ 300000000 [get_debug_cores dbg_hub]
set_property C_ENABLE_CLK_DIVIDER false [get_debug_cores dbg_hub]
set_property C_USER_SCAN_CHAIN 1 [get_debug_cores dbg_hub]
connect_debug_port dbg_hub/clk [get_nets clk]
